package com.telegram.bilavorona.util;

public class TextConstants {
    public static final String HELP_TEXT = """
                📋 *Команди:*
                
                🔹 /start - Вітальне повідомлення.
                🔹 /help - Довідкова інформація.
                🔹 /contacts - Отримати контактну інформацію
                🔹 /contact_manager - Надіслати повідомлення нашому менеджеру
                
                📄 *Робота з файлами:*
                🔹 /documentation - Отримати документи з розділу Документація.
                🔹 /examples - Отримати приклади виконаних робіт.
                
                🔹 /help_admin - Отримати команди для адміністратора.
                🔹 /exit - Скасування віправки всіх активних команд.
                """;
    public static final String HELP_TEXT_ADMIN = """
                🛠 *Команди для адміністратора:*
                🔹 /get_all_files - Отримати всі файли.
                🔹 /delete_user - Видаляє користувача за його юзернеймом. Приклад: `/delete_user @username`
                🔹 /change_role - Змінює роль користувача за його юзернеймом. Приклад: `/change_role @username`
                🔹 /send_for_all_user - Відправляє повідомлення/файл всім користувачам. Приклад: `/send_for_all_user після чого потрібно додати файли, або написати повідомлення`
                🔹 /send_for_username - Відправляє повідомлення/файл вказаному користувачу за його id. Приклад: `/send_for_username @username після чого потрібно додати файли, або написати повідомлення`
                🔹 /change_file_group_by_id - Змінити групу файлу за його ID. Приклад: `/change_file_group_by_id 123 DOCUMENTATION`
                🔹 /change_file_group_by_name - Змінити групу файлу за його назвою. Приклад: `/change_file_group_by_name file_name.docx EXAMPLES`
                🔹 /change_file_name_by_id - Змінити назву файлу за його ID. Приклад: `/change_file_name_by_id 123 new_name.docx`
                🔹 /change_file_name_by_name - Змінити назву файлу за його поточною назвою. Приклад: `/change_file_name_by_name old_name.docx new_name.docx`
                🔹 /delete_file_by_id - Видалити файл за його ID. Приклад: `/delete_file_by_id 123`
                🔹 /delete_file_by_name - Видалити файл за його назвою. Приклад: `/delete_file_by_name file_name.docx`
                🔹 /get_all_users - Отримати всіх користувачів з БД
                
                📌 *Примітка:* Завантажувати файли в БД мають право тільки *АДМІНІСТРАТОРИ*.
    """;
    public static final String START_TEXT = """
✨ Ласкаво просимо до офіційного бота компанії "БІЛА ВОРОНА"! 🕊️
    📌 Наш продукт — «Велконлак - ГПМ» — це інноваційний двокомпонентний біополімер, створений на 100% з натуральних олій: 🌱 соєвої, рицинової та інших. Завдяки відсутності розчинників та шкідливих полімерів, він є безпечним для контакту з харчовими та медичними продуктами 🥦🧴, що підтверджено санітарно-гігієнічним висновком. ✅
        🔹 Основні властивості «Велконлак - ГПМ»:
•	🌿 Екологічність: Не містить розчинників і полімерів, що можуть розкладатися з виділенням шкідливих сполук.
•	🛡️ Міцність: Стійкий до механічних впливів та хімічних реагентів 🧪, включаючи мийні та дезінфікуючі засоби.
•	🔄 Універсальність: Підходить для покриття підлоги, стін, металоконструкцій, трубопроводів та інших поверхонь.
•	🛠️ Зручність у використанні: Змішується вручну або дрилем 🌀 у співвідношенні від 1,5 до 6:1 за вагою та наноситься шпателем, пензлем або валиком. Полімеризується від 1 до 6 годин. ⏱️
        🌍 Сфери застосування:
•	🏭 Промислові та технічні приміщення: Захист підлоги, стін, покрівлі та обладнання.
•	🥫 Харчова та медична галузь: Безпечний контакт з продуктами харчування, питною водою, спиртами та соками.
•	⚙️ Антикорозійний захист: Металоконструкції, трубопроводи, технічні ємності.
•	🏠 Житлові та комерційні приміщення: Спортивні зали, гаражі, паркінги та складські комплекси.
    📌 Дізнайтеся більше про наші продукти та можливості! 🔍
Натискайте /start або оберіть потрібний розділ у меню. 📲
❓ Якщо у вас виникли запитання — ми завжди раді допомогти! 😊
    """;

    public static final String CONTACTS_TEXT = """
📞 Наші контакти 📞
🏢 Товариство з обмеженою відповідальністю “ВЕЛКОН”

📲 Телефон: +38098 679 41 20
✉️ e-mail: velkon8@gmail.com

📡 Доступні месенджери:

📳 Viber
💬 WhatsApp
✈️ Telegram
🔒 Signal
🛠 Зв'язуйтесь з нами для консультацій та замовлень! 💬
    """;
}
